INSERT INTO Client(Last_name, First_name, Middle_name, Date_of_birth, Client_address, Phone_number, Email, Discount) VALUES
('Иванов', 'Иван', 'Иванович', '1990-05-15', 'Москва, ул. Пушкина, д.10, кв.5', '+7 (999) 123-45-67', 'ivanov@example.com', 0.0),
('Петров', 'Петр', 'Петрович', '1985-08-20', 'Санкт-Петербург, пр. Невский, д.20, кв.10', '+7 (999) 234-56-78', 'petrov@example.com', 0.05),
('Сидоров', 'Сидор', 'Сидорович', '1978-03-10', 'Екатеринбург, ул. Ленина, д.30, кв.15', '+7 (999) 345-67-89', 'sidorov@example.com', 0.1),
('Козлов', 'Козел', 'Козлович', '1982-11-25', 'Новосибирск, ул. Гагарина, д.40, кв.20', '+7 (999) 456-78-90', 'kozlov@example.com', 0.15),
('Николаев', 'Николай', 'Николаевич', '1975-09-18', 'Казань, ул. Пушкина, д.50, кв.25', '+7 (999) 567-89-01', 'nikolaev@example.com', 0.2),
('Кузнецов', 'Кузьма', 'Кузьмич', '1993-07-30', 'Волгоград, ул. Ленина, д.60, кв.30', '+7 (999) 678-90-12', 'kuznetsov@example.com', 0.25),
('Смирнова', 'Смирна', 'Смирновна', '1988-12-05', 'Уфа, ул. Гагарина, д.70, кв.35', '+7 (999) 789-01-23', 'smirnova@example.com', 0.3),
('Морозов', 'Мороз', 'Морозович', '1980-04-22', 'Омск, ул. Пушкина, д.80, кв.40', '+7 (999) 890-12-34', 'morozov@example.com', 0.35),
('Попова', 'Попка', 'Поповна', '1973-01-12', 'Томск, ул. Ленина, д.90, кв.45', '+7 (999) 901-23-45', 'popova@example.com', 0.4),
('Васильев', 'Василий', 'Васильевич', '1986-06-28', 'Красноярск, ул. Гагарина, д.100, кв.50', '+7 (999) 012-34-56', 'vasiliev@example.com', 0.45);

INSERT INTO Cashier (Cashier_id, Last_name, First_name, Middle_name, Date_of_birth, Phone_number, Experience) VALUES
(1, 'Иванов', 'Петр', 'Иванович', '1985-05-10', '+7 (999) 123-45-67', 5),
(2, 'Петрова', 'Анна', 'Сергеевна', '1990-10-15', '+7 (999) 234-56-78', 3);

INSERT INTO ProductType (Type_id, Name) VALUES
(1, 'цветок'),
(2, 'букет'),
(3, 'доптовар');

INSERT INTO Supplier (Organization_name) VALUES 
('С любовью!'),
('Бутон');

INSERT INTO Warehouse (Warehouse_address) VALUES 
('Саратов, ул. Загороднева, д. 4');

INSERT INTO Orders (Client_id, Order_date) VALUES 
(1, '2024-02-29'),
(2, '2024-03-01'),
(3, '2024-03-02');

INSERT INTO Receipt (Order_id, Cashier_id, Issue_date, Amount) VALUES 
(1, 1, '2024-02-29', 0),
(2, 1, '2024-02-29', 0),
(3, 1, '2024-02-29', 0);
